export default {
  name: '酸碱中和反应',
  id: 1,
  comment: '',
  paragraphs: [
    {
      id: '初始画面',
      talks: [
        '嘿！这不是新来的实验家吗？你好呀！',
        '很高兴你能接受这次**酸碱中和反应实验**的挑战任务。',
        '我是这次实验的导航精灵，也可以把我当作是你的小助手哦，在这次任务中我会尽全力帮助你完成这次实验的。',
        '那么聪明勇敢的实验家，准备好开始这次的实验旅程了吗？',
      ],
      choices: [
        { name: '我准备好了！', replies: ['很好！很有勇气！'] },
        {
          name: '看起来好难...',
          replies: ['嘿，放轻松，我可是很相信实验家的实力的，我也会帮助你一起完成这次任务的。'],
        },
      ],
    },

    // 问题情景
    {
      id: '问题导入',
      talks: [
        '本次实验需要我们掌握正确的实验仪器操作方法，并学会利用不同的酸碱指示剂，观察与探究酸溶液与碱溶液之间发生的化学现象与反应。',
      ],
    },

    {
      id: '选择酸溶液',
      talks: [
        '事不宜迟，我们先开始实验的第一步吧。',
        '酸溶液在本次实验中是必不可少的。',
        '所以我特意为你提供了两种酸性溶液供你选择哦，都已经放在试管的左侧了。',
        '试着去点击其中一种酸溶液吧！',
      ],
    },

    {
      id: '滴加酸溶液',
      talks: [
        '酸溶液选择完毕！这一次就由我来帮你把它滴入试管中吧。',
        '接下来请一定要注意观察下面的实验操作哦。',
      ],
    },

    {
      id: '滴加酸溶液提问',
      talks: [
        '好啦，现在酸溶液已经滴加完毕，不知道实验师看清刚才的实验操作了吗？',
        '接下来是问题环节~！',
        '聪明的实验师，你觉得刚才滴加溶液的操作是规范的吗？',
      ],
      choices: [
        { name: '我觉得完全正确', replies: ['很遗憾，没有回答正确哦。'] },
        { name: '我感觉并不规范', replies: ['bingo~！回答正确！'] },
        { name: '我想再看一遍', replies: ['好的，那我们再看一遍吧！'] },
      ],
    },

    {
      id: '滴管滴加解释',
      talks: [
        '在刚才滴入酸溶液的时候，我们将胶头滴管伸入了**试管的内部**，这一步的实验操作其实是**不规范**的。',
        '要注意，在滴液时如果将胶头滴管伸入管的内部，很容易使胶头滴管**碰到试管的内壁，导致胶头滴管被污染**。',
        '并且在下次使用被污染的胶头滴管时，会影响到其他的药品，造成交叉污染，这样不仅会导致实验结果受到干扰，严重的还会引发化学事故哦。',
        '所以在使用胶头滴管滴液时，一定要注将其**竖直悬空于试管之上，不能伸入或接触试管**哦。',
      ],
      choices: [
        {
          name: '原来是这样！',
          replies: [
            '看来实验师已经弄明白了刚才关于胶头滴管的使用说明了呀。',
            '对啦！正好我这里有一道小测试题，实验师试着完成一下，让我见识下你的实力吧！',
          ],
        },
        {
          name: '还..没有听明白，能重复一遍吗?',
          replies: ['当然没问题！实验师注意听讲哟。'],
        },
      ],
    },

    {
      id: '选择碱溶液',
      talks: [
        '既然酸溶液已经滴入完毕，接下来就该选择**碱溶液**了。',
        '同样的，这次也有两种碱溶液可以选择哦，分别是氢氧化钠溶液和氢氧化钡溶液。',
        '两种溶液的试剂瓶在试管的右侧，现在点击其中一种溶液滴加至试管中吧！',
      ],
    },

    {
      id: '滴加碱溶液',
      talks: [
        '好了实验师，现在试着利用胶头滴管，将刚才选择的碱溶液逐滴地滴入试管里面吧。',
        '滴加后，要注意观察都出现了哪些实验现象哦。',
      ],
    },

    {
      id: '阶段一-提交实验结论后',
      talks: [
        '实验结论提交成功！非常棒，实验师(๑•̀ㅂ•́)و✧。',
        '有没有感到有点奇怪呢？好像试管里的溶液看起来并没有什么明显的反应。',
        '其实在某些酸碱物质的中和反应中，不会出现太明显的现象变化，就像刚才实验师所观察到的那样。',
        '但是有些中和反应，根据酸碱溶液的不同，会有不同的反应现象，比如说生成沉淀物或者气泡。',
        '不过如果没有明显反应的话，我们可以使用什么方法来帮助我们看到试管中溶液的变化呢？',
      ],
      //这里加了个选项
      choices: [
        {
          name: '试试酸碱指示剂吧！',
          replies: [
            '没错~！就是酸碱指示剂！它可以帮助我们看到溶液的酸碱性变化。',
            '我把常见的酸碱指示剂拿出来试试吧！',
          ],
        },
        {
          name: '摇一摇！晃一晃！',
          replies: [
            '诶？！这并不是在喝果粒橙啦~！',
            '我们可以使用**酸碱指示剂**来帮助我们观察溶液的酸碱性变化~!',
          ],
        },
      ],
    },

    {
      id: '酸碱指示剂出现',
      talks: [
        '实验师，看到在试管后面放着的酸碱指示剂了吗？',
        '紫色的那瓶是【石蕊试剂】，它在酸性溶液中呈**红色**，中性溶液中呈**紫色**，碱性溶液中呈**蓝色**。',
        '无色透明的那瓶是【酚酞试剂】，它的特点超级好记~，在碱性溶液下呈**红色**！',
      ],
    },

    {
      id: '清空试管',
      talks: [
        '不过，现在的试管中的溶液已经进行过中和反应了，直接添加酸碱指示剂也不太合适呢。',
        '让我们先倒空试管，再进行实验吧！',
      ],
    },

    {
      id: '第一次自由实验导入',
      talks: [
        '现在试管里的溶液已经被我倒空啦！',
        '那么就让我们正式开始酸碱中和反应的实验吧！',
        '因为不同的酸碱指示剂出现的实验现象各不相同，所以接下来我们会进行两轮实验，每一轮使用一种酸碱指示剂。',
        '那么，实验开始！注意:左侧的面板上也会提示你实验步骤哦，请实验师留意！',
      ],
    },

    {
      id: '第一次自由实验总结',
      talks: [
        '恭喜实验师完成第一次自由实验任务୧(๑•̀◡•́๑)૭。',
        '这次我们成功地使用了`酸碱指示剂`作为我们的酸碱指示剂。',
        '接下来的环节..相信实验师你也应该猜到了吧!',
        '没错！让我们试试另一种酸碱指示剂吧！',
        '在此之前，我们先清空试管',
      ],
    },

    {
      id: '第二次自由实验导入',
      talks: ['试管清空完成！', '实验师，开始第二次的自由实验吧！'],
    },

    {
      id: '第二次自由实验完成',
      talks: [
        '第二次自由实验顺利完成！干的非常出色实验师！(๑•̀ㅂ•́)و✧',
        '这次我们使用的是`酸碱指示剂`作为我们的酸碱指示剂。',
        '实验师已经观察到不同酸碱指示剂下的中和反应，都有哪些不一样的特征了呢。',
        '而且经过两轮的酸碱中和实验，相信实验师已经对酸碱中和反应有一定了解了吧！',
        '不如..我们来稍微复盘一下刚才进行的实验吧？',
      ],
      choices: [
        { name: '正有此意！', replies: ['不愧是被选中的实验师，在实验的最后还是具有探究精神！'] },
        {
          name: '复盘..好麻烦呀',
          replies: [
            '温故而知新！虽然做了这么多的实验，但是总结可是很有必要的哦。',
            '最后的最后我就稍微多唠叨几句啦o(￣︶￣)o',
          ],
        },
      ],
    },

    {
      id: '实验复盘1',
      talks: [
        '酸碱中和反应其实就是酸与碱互相抵消，让酸碱度**回归中性**的反应。',
        '在酸碱中和反应中，其实最重要的就是要观察溶液的酸碱度即**pH值的变化**。',
        '可是pH值是没有办法直接观察到的，该怎么办呢？',
      ],
      choices: [
        { name: '使用酸碱指示剂！', replies: ['没错！酸碱指示剂是我们判断酸碱度的好帮手！'] },
        {
          name: '用心去感受！',
          replies: [
            '虽然听起来很帅！但不对劲啦！这时候要记住使用**酸碱指示剂**了哦！',
            '酸碱指示剂是我们判断酸碱度的好帮手。',
          ],
        },
      ],
    },

    {
      id: '实验复盘2',
      talks: [
        '在滴加酸碱指示剂后，就可以根据溶液的颜色去判断它的酸碱度了！',
        '在刚才的实验中，如果滴加了石蕊试剂就可以看到颜色**从红变紫再到蓝**。',
        '如果滴加了酚酞试剂则从**无色到红色**。',
        '代表着原来的酸溶液随着碱溶液的滴入逐渐变为**中性**。',
        '但随着酸溶液被**完全反应**后，碱溶液还再不断滴入，最后溶液又变为了**碱性**。',
        '这就是刚才实验现象的解释了~，实验师都弄明白了吗？',
      ],
      choices: [
        { name: '原来如此！我懂了。', replies: ['太棒了！(๑•̀ㅂ•́)و✧，真不愧是最最最最最优秀的实验师！'] },
        { name: '可以再说一遍嘛？', replies: ['当然没有问题！接下来我就再复盘一遍哦。'] },
      ],
    },

    {
      id: '结束语1',
      talks: ['总之恭喜你！实验师，这次的任务圆满完成！', '啪叽啪叽啪叽（拍手）'],
      choices: [
        { name: '总感觉很敷衍的庆祝呢...', replies: ['Σ(⊙▽⊙！明明是发自真心地祝贺...'] },
        { name: '嘿嘿~谢谢你！', replies: ['嘿嘿，都是实验师你自己努力的功劳啦！'] },
      ],
    },

    {
      id: '结束语2',
      talks: [
        '不管怎么样..接下来就到了说道别的时候咯。',
        '接下来的时间，就交给实验师自己去自由探索啦。',
        '去尝试其他的反应物的组合吧，看看会不会有新的发现呢？',
        '期待与你的下次冒险哦！实验师，下次再见啦ヾ(0▽0)',
      ],
      choices: [{ name: '下次再见！' }],
    },
  ],
}
