export default {
    name: '探究摩擦力',
    paragraphs: [
        //主线 
        {
            id: '原因分析',
            talks: [
                '今天我的任务，是要把挂在我后面的大木块给搬走。',
                // '但丢人的是..作为一个搬运机器人，这次的货物我完全搬不动！',
                // '实验师，可以麻烦你帮我分析一下原因吗？',
            ],
            choices: [{
                name: '可能是摩擦力太大了',
                replies: [
                    '摩擦力？！（机器人信息检索中...）',
                    // '原来如此！没错就是摩擦力！',
                    // '根据我的脑内芯片预存的科学知识显示。',
                    // '摩擦力，就是一个物体在另一个物体表面上**运动**或者**将要运动**时，产生的**阻碍它们相对运动**的力。',
                    // '比如我这次向前拉货物，就是因为货物和地面产生了阻碍货物向前摩擦力，所以我才拉的这么费劲。',
                    // '如果摩擦力会阻碍我的话，那是不是只要减少摩擦力，我就可以轻松地拉动货物啦！！',
                    // '可是..该怎么减小摩擦力呢？（机器人信息再次检索中....）',
                    // '实验师..可能要麻烦你帮忙了！有什么办法可以减少摩擦力的大小呢？',
                ]
            }]
        },
        {
            id: '摩擦力是什么',
            talks: [
                '系统：请提出你的方法。'
            ],
        },
        {
            id: '机器人的吐槽',
            talks: [
                '实验师，所有减少摩擦力的方法都已经试过了吗？！',
                '咦？！突然发现，原来不知不觉中就到了目的地了呀。'
            ],
            choices: [{
                name: '太好了！原来这里就是目的地啊！',
                replies: [
                    '没错！出发前，老板还叮嘱过我的，目的地就在这！',
                ]
            },
            {
                name: '厉害吧！其实我都计算好了的！',
                replies: [
                    '连目的地的位置也在实验师的掌控之中吗？！Σ(⊙▽⊙',
                ]
            }
            ]
        },
        {
            id: '大总结',
            talks: [
                '虽然挺不好意思，最最最最最后可以麻烦实验师帮我一个小忙嘛？',
                '嘿嘿，就是帮我总结一下怎么减小摩擦力啦！',
                '弄懂了摩擦力，感觉对我以后的搬运生涯有很大的帮助！就麻烦实验师了。',
                '系统：接下来是总结环节，请做出正确的选择。'
            ],
        },
        {
            id: '总结任务1',
            talks: [
                '关于物体之间接触面的**粗糙程度**与摩擦力大小关系说法正确的是?( )',
            ],
        },
        {
            id: '总结任务2',
            talks: [
                '关于物体之间接触面的**面积大小**与摩擦力大小关系说法正确的是?( )',
            ],
        },
        {
            id: '总结任务3',
            talks: [
                '关于物体给予接触面的**压力大小**与摩擦力大小关系说法正确的是?( )',
            ],
        },
        //一级分支
        {
            id: '改变接触面粗糙程度',
            talks: [
                '也就是地面的**粗糙程度**吗？听起来有道理！',
                '但是..实验师，不是我说呀..',
                '我连货物都搬不动，你要怎么换个地方呢？',
                '系统：请选择一种接触面（地面）进行改变...'
            ],
        },
        {
            id: '改变与接触面的面积',
            talks: [
                '之前还真没有想到过..把货物翻个面，改变与地面的接触面积什么的..',
                '接触面积更大一点会比较好呢，还是更小一点会比较好呢？'
            ],
            choices: [{
                name: '试着把接触面积减小吧',
                replies: ['没问题，把货物翻到最小的那一面对吧！']
            },
            {
                name: '试着把接触面积增大吧',
                replies: ['没问题，把货物翻到最大的那一面对吧！']
            },
            ]
        },
        {
            id: '改变物体的质量',
            talks: [
                '货物的质量嘛..',
                '可能是老板这次让搬的东西太重了也说不定..',
                '该怎么改变货物质量呢，我可不敢把老板里面的东西给丢掉呀..'
            ],
        },
        {
            id: '质量调节器',
            talks: [
                '系统：**质量调节器**已准备就绪，帮助机器人调节货物的质量吧！',
                '系统：拖动滑块来调节重物的质量，在选择好质量后，点击确定即可让重物质量改变。',
            ],
        },
        //二级分支
        //地面
        {
            id: '荒地',
            talks: [
                '荒地对话',
                // '感觉空气都新鲜了好多..',
                // '不过相比刚才的地方，地面变得更粗糙了，我看看这次能不能拉动货物吧。'
            ],
        },
        {
            id: '草地',
            talks: [
                '实验师你是来自哪里的魔法师吗？！地面居然变成了一片充满生命绿的草地！',
                '感觉空气都新鲜了好多..',
                '不过相比刚才的地方，地面变得更粗糙了，我看看这次能不能拉动货物吧。'
            ],
        },
        {
            id: '草地后',
            talks: [
                '嘿呀！嘿呀！（卖力拉货中）',
                '结果....',
                '完 全 拉 不 动！！',
                '（系统记录：在**很粗糙**的草地上无法拉动重物）',
                '系统：货物拉动失败...'
            ],
        },
        {
            id: '木板',
            talks: [
                '嗯？突然感受到了家的味道..',
                '原来地面变成了木地板啊！',
                '相比一开始运货的地方，似乎会光滑很多呢！这次我试试看运货吧！'
            ],
        },
        {
            id: '木板后',
            talks: [
                '嘿呀！嘿呀！（卖力拉货中）',
                '虽然感觉拉的很费劲...不过好在货物被拉动了！',
                '（系统记录：在**比较光滑**的木地板上可以拉动货物，但拉动的很费力）',
                '系统：货物拉动成功！',
            ],
        },
        {
            id: '冰面',
            talks: [
                '怎么突然感觉...脚下好凉！',
                '原来地面被实验师用奇怪的魔法，变成了滑溜溜的冰面！',
                '还好我站得稳，不然稍不留神就要摔跤了..',
                '不过在冰面上拉货，还蛮新鲜的，不知道这次还能拉动嘛，总之我先去试试吧！',
            ],
        },
        {
            id: '冰面后',
            talks: [
                '嘿！',
                '我的老天！这也太快了吧实验师！',
                '虽然从事这么久的搬运工作，但还是第一次感受到这么快的搬运速度！',
                '（系统记录：在**光滑**的冰面上可以很轻松的拉动货物）',
            ],
        },
        {
            id: '接触面总结',
            talks: [
                '啊咧？地面变回来了，感觉还没玩..啊不对，还没搬够呢。',
                '但是在换别的方式之前，我想请实验师帮我一个小忙..',
                '刚才多亏了实验师，我才知道原来物体之间接触面的粗糙程度，是会影响到摩擦力的大小的。',
                '实验师可以麻烦你帮我总结一下..接触面的粗糙程度和摩擦力大小的关系吗？',
                '系统：根据刚才观察到的不同的接触面与机器人的拉货情况，做出总结吧。'
            ],
            choices: [{
                name: '接触面越光滑，摩擦力越小',
                replies: ["原来是这样！**接触面越光滑，摩擦力越小**。"],
            },
            {
                name: '接触面越光滑，摩擦力越大',
                replies: ["咦？总感觉有些不对呢.."],
            }
            ]
        },
        {
            id: '接触面正确结束',
            talks: [
                '所以在越光滑的地面上，我拉的越轻松呢！',
                '谢谢你！实验师♪(･ω･)ﾉ',
                '接下来我们来试试别的方法吧！',
                '系统：请选择别的方式来减小摩擦力，帮助机器人搬运货物吧！',
            ],
        },
        {
            id: '接触面回答错误',
            talks: [
                '虽然我的记忆存储空间不太够了，但还稍微残留了一点在**光滑**的冰面上快乐地拉货的印象来着..',
            ],
            choices: [{
                name: '其实是接触面越光滑，摩擦力越小',
                replies: ['原来是这样！**接触面越光滑，摩擦力越小**。'],
            },]
        },
        //接触面积
        {
            id: '竖向放置',
            talks: [
                '哦！货物竖起来了！',
                '现在接触面明显变小了，会不会更容易拉呢？我先试试！',
                '接触面积变小似乎好像也没什么变化呀...',
                '还是把货物翻回来吧。',
            ],
            choices: [{
                name: '试着把接触面积变大吧！',
                replies: [
                    '没问题，把货物翻到最大的那一面对吧！',
                ]
            },]
        },
        {
            id: '平躺放置',
            talks: [
                '哦！货物翻转过来了！',
                '现在接触面明显变大了，会不会更容易拉呢？我先试试！',
                '实验师...怎么感觉接触面积变大也没有啥作用呀...',
                '还是把货物翻回来吧。',
            ],
            choices: [{
                name: '试着把接触面积变小吧！',
                replies: ['没问题，把货物翻到最小的那一面对吧！']
            },]
        },
        {
            id: '接触面积总结',
            talks: [
                '系统：根据刚才观察到的不同的接触面的面积与机器人的拉货情况，做出总结吧。',
            ],
            choices: [{
                name: '摩擦力与物体接触面的面积无关',
                replies: ['你说的有道理，经过这几次测试我也发现了，**摩擦力与物体接触面的面积大小是无关的**！']
            },
            {
                name: '摩擦力与物体接触面的面积有关',
                replies: [
                    '实验师，我觉得**摩擦力可能与物体接触面积之间是没有关系的**',
                    '不然我怎么还是拉不动呢？'
                ]
            }
            ]
        },
        //质量
        {
            id: '轻松拉货',
            talks: [
                '系统：重物质量改变成功。',
                '咦？看实验师这期待的表情...满脸写着【我已经调好了质量，赶紧拉拉看！】的意思。',
                '总之相信你实验师，运货开始！',
                '嘿！实验师快看！',
                '怎么样？厉害吧！货物很轻松地就被我拉过去了。',
            ],
            choices: [{
                name: '我继续帮你调整下质量吧！',
                replies: [
                    '实验师原来你还能继续调质量呀！',
                    '那么重新交给你啦！'
                ]
            },
            {
                name: '试试其他方法去拉动重物吧！',
                replies: ['诶？实验师你的魔力不够了嘛..我还刚沉浸在搬运的快感中没多久耶！']
            }
            ]
        },
        {
            id: '质量总结',
            talks: [
                '不过我发现了，如果改变货物的质量，摩擦力确实也会跟着变耶！',
                '实验师可以麻烦你帮我做做总结吗？',
                '系统：请根据所调节的重物质量，与机器人的搬运情况，做出总结吧！'
            ],
            choices: [{
                name: '物体越轻，对地面的压力越小，摩擦力越小',
                replies: [
                    '没错，我也发现了这一点！',
                    '物体越**轻**，对**接触面也就是地面的压力就会越小**，摩擦力就越小，然后我才能拉得动货的！',
                    '所以当实验师把货物的质量减小后，我拉起货来那就是突出一个字——“快”！'
                ]
            },
            {
                name: '物体越轻，对地面的压力越小，摩擦力越大',
                replies: [
                    '我猜实验师你一定在考验我吧！',
                    '应该是物体越**轻**，对接触面也就是地面的压力**越小**，摩擦力越**小**才对吧！',
                    '虽然身为专为搬运而生的机器人，我也是有一定的思考能力的！'
                ]
            }
            ]
        },
        {
            id: '质量结束',
            talks: [
                '不过既然不能再继续改变质量了，那我们来试试别的方法吧！',
                '系统：请选择别的方式来减小摩擦力，帮助机器人搬运货物吧！',
            ],
        },

        //结局
        {
            id: '结局',
            talks: [
                '原来如此！多亏遇见了实验师，我才知道简简单单的搬运也有这么多学问呢！',
                '这下我总算知道怎么来减小摩擦力了！',
                '你们人类最喜欢的一句话叫什么来着...对啦！“学以致用”！',
                '以后运货，就选择表面更光滑、更轻的货物去拉就好啦。'
            ],
            choices: [{
                name: '你还是去换个更好的引擎吧。',
                replies: [
                    '那可不行，我还需要攒点钱替换我的记忆芯片呢。',
                    '我可是要励志当一个有头脑、有学问、有知识的搬运机器人！',
                    '这次任务比较紧急，下次再遇到你我再好好答谢你吧！',
                    '再见！',
                    '系统：本次摩擦力探究实验结束，接下来是自由探究环节...'
                ]
            },
            {
                name: '虽然听起来没错，总感觉感觉你在偷懒呢..',
                replies: [
                    '才...才没有这回事呢！！',
                    '我可是要励志当一个有头脑、有学问、有知识的搬运机器人！',
                    '这次任务比较紧急，下次再遇到你我再好好答谢你吧！',
                    '再见！',
                    '系统：本次摩擦力探究实验结束，接下来是自由探究环节...'
                ]
            }
            ]
        },
        {
            id: '自由探究',
            talks: [
                '请自由探究。',
            ],
        },
        {
            id: '自由改变部分',
            talks: [
                '',
                '总之，我先拉拉看吧！',
                '',
            ]
        }
    ]
}