export default {
    name: '探究摩擦力',
    paragraphs: [
        //主线 
        {
            id: '原因分析',
            talks: [
                '我叫小甲，一位勤奋努力的搬运机器人，今天的我依旧努力地进行着搬运工作。',
                '因为拉货时产生的滑动摩擦力太大了，今天的搬运任务异常地费力....',
                '实验师，有什么方法可以控制滑动摩擦力的大小吗？',
            ],
        },
        {
            id: '摩擦力是什么',
            talks: [
                '系统：请作出你的假设。'
            ],
        },
        //一级分支
        {
            id: '改变接触面粗糙程度',
            talks: [
                '确实......我也感觉粗糙程度和滑动摩擦力似乎存在着某种关系！',
                '实验师可以通过控制地面材质、调整压力大小、变换货物放置位置来探索它们的关系！',
                '实验师，我们这次探究的是滑动摩擦力与**粗糙程度**的关系。需要保证**接触面积**和**物体对地面的压力**相同是不是才正确呢？'
            ],
        },
        {
            id: '改变与接触面的面积',
            talks: [
                '这么一说......我也感觉接触面积和滑动摩擦力似乎存在着某种关系！',
                '实验师可以通过控制地面材质、调整压力大小、变换货物放置位置来探索它们的关系！',
                '实验师，我们这次探究的是滑动摩擦力与**接触面积**的关系。需要保证**粗糙程度**和**物体对地面的压力**相同是不是才正确呢？'
            ],
        },
        {
            id: '改变物体的质量',
            talks: [
                '看起来......我也感觉物体对地面的压力和滑动摩擦力似乎存在着某种关系！',
                '实验师可以通过控制地面材质、调整压力大小、变换货物放置位置来探索它们的关系！',
                '实验师，我们这次探究的是滑动摩擦力与**物体对地面的压力**的关系。需要保证**粗糙程度**和**接触面积**相同是不是才正确呢？'
            ],
        },
        //二级分支
        //地面
        {
            id: '荒地',
            talks: [
                '',
                '接下来我就会尝试去拉动看看了~，实验师记得**记录数据**哦！',
            ],
        },
        {
            id: '荒地后',
            talks: [
                '**拉动完毕，请记录数据喔~！**',
            ],
        },
        {
            id: '草地',
            talks: [
                '',
                '接下来我就会尝试去拉动看看了~，实验师记得**记录数据**哦！',
            ],
        },
        {
            id: '草地后',
            talks: [
                '**拉动完毕，请记录数据喔~！**',
            ],
        },
        {
            id: '木板',
            talks: [
                '',
                '接下来我就会尝试去拉动看看了~，实验师记得**记录数据**哦！',
            ],
        },
        {
            id: '木板后',
            talks: [
                '**拉动完毕，请记录数据喔~！**',
            ],
        },
        {
            id: '冰面',
            talks: [
                '',
                '接下来我就会尝试去拉动看看了~，实验师记得**记录数据**哦！',
            ],
        },
        {
            id: '冰面后',
            talks: [
                '**拉动完毕，请记录数据喔~！**',
            ],
        },
        {
            id: '接触面总结',
            talks: [
                '滑动摩擦力与粗糙程度的探究结束，我们这次做了3次实验尝试，实验师有好好的把数据记录下来吗~？',
                '接下来我们就去探究别的因素吧！',
            ],
        },
        //接触面积
        {
            id: '侧躺放置',
            talks: [
                '',
                '接下来我就会尝试去拉动看看了~，实验师记得**记录数据**哦！',
                '**拉动完毕，请记录数据喔~！**'
            ]
        },
        {
            id: '竖向放置',
            talks: [
                '',
                '接下来我就会尝试去拉动看看了~，实验师记得**记录数据**哦！',
                '**拉动完毕，请记录数据喔~！**'
            ]
        },
        {
            id: '平躺放置',
            talks: [
                '',
                '接下来我就会尝试去拉动看看了~，实验师记得**记录数据**哦！',
                '**拉动完毕，请记录数据喔~！**'
            ]
        },
        {
            id: '接触面积总结',
            talks: [
                '滑动摩擦力与接触面积的探究结束，我们这次做了3次实验尝试，实验师有好好的把数据记录下来吗~？',
                '接下来我们就去探究别的因素吧！',
            ],
        },
        //质量
        {
            id: '轻松拉货',
            talks: [
                '',
                '接下来我就会尝试去拉动看看了~，实验师记得**记录数据**哦！',
                '**拉动完毕，请记录数据喔~！**'
            ],
        },
        {
            id: '质量总结',
            talks: [
                '滑动摩擦力与质量总结的探究结束，我们这次做了3次实验尝试，实验师有好好的把数据记录下来吗~？',
                '接下来我们就去探究别的因素吧！'
            ],
        },

        {
            id: '机器人的吐槽',
            talks: [
                '诶？！3种因素都已经探索完毕了？！！',
                '我也不知不觉到达了搬运的目的地...实验数据的话，我看到实验师都有好好地进行记录呢~！',
                '果然滑动摩擦力还是很深奥呢！接下来就麻烦实验师根据实验数据进行总结啦~。',
                '究竟滑动摩擦力和这三个因素之间有什么关系呢?...'
            ],
        },

        {
            id: '总结任务1',
            talks: [
                '关于物体之间接触面的**粗糙程度**与摩擦力大小关系说法正确的是?( )',
                '',
            ],
        },
        {
            id: '总结任务2',
            talks: [
                '关于物体之间接触面的**面积大小**与摩擦力大小关系说法正确的是?( )',
                '',
            ],
        },
        {
            id: '总结任务3',
            talks: [
                '关于物体给予接触面的**压力大小**与摩擦力大小关系说法正确的是?( )',
                '',
            ],
        },

        //结局
        {
            id: '结局',
            talks: [
                '那么这次多亏了实验师帮忙控制滑动摩擦力，我才能到达目的地。并且搞清楚滑动摩擦力对我的搬运生涯也有很大的用处呢！(๑•̀ㅂ•́)و✧',
                '超级感谢实验师的帮忙，我们下次再见吧~！',
            ],
        },
    ]
}