export default {
    name: '探究摩擦力',
    id: 1,
    comment: '',
    paragraphs: [{
            id: '初始画面',
            talks: [
                '？？？：嘿呀！（不远处似乎传来了什么动静）',
                '？？？：嘿呀~！嘿呀~！（似乎是什么人在努力拉动什么的声音）',
                '？？？：嘿~~~~~呀~~~~！（似乎是拼进了全力的样子）',
                '？？？：呼~我的老天！已经使用100%的功率了，货物还是纹丝不动..',
                '？？？：老板交给我的任务这下...要搞砸了呀！这个月的新型电池要买不起了..',
                '？？？：如果有谁正好能过来帮下忙就好了，但这种好事不会降临到我身上吧o(╥﹏╥)o'
            ],
            choices: [
                { name: '似乎看起来很困扰的样子，需要帮忙吗？', replies: ['？？？：？！！'] },
                { name: '看来好事要降临了哦，需要帮忙吗？', replies: ['？？？：？！！'] }
            ]
        },
        {
            id: '路过的工程师',
            talks: [
                '？？？：是上天回应了我的召唤吗？！救星呀！！',
                '？？？：啊..对不起失礼了..请先让我自我介绍一下。',
                '？？？：正如你所见，我是一名搬运机器人，我的全名是【纯搬运机器人甲】，因为太长了，所以叫我【小甲】就好了。',
                '小甲：我知道我的名字有点路人甲的味道..但..喂！你笑的也太过头了吧！！',
                '小甲：好了好了，我这边介绍完了，不知道大救星该怎么称呼呢？'
            ],
            choices: [{
                    name: '只是一个正好路过的【实验师】罢了。',
                    replies: ['小甲：实验师？！！不就是那个被选中的科学实验探索超人吗！！Σ(⊙▽⊙)',
                        '小甲：我今天真是见到了不得了的人呀~！有了实验师的帮助，我的任务应该能完美解决了！',
                        '小甲：我已经能想象到老板夸我的画面了，诶嘿~！'
                    ]
                },
                {
                    name: '叫我【实验师】就好。',
                    replies: ['小甲：实验师？！！不就是那个被选中的科学实验探索超人吗！！Σ(⊙▽⊙)',
                        '小甲：我今天真是见到了不得了的人呀~！有了实验师的帮助，我的任务应该能完美解决了！',
                        '小甲：我已经能想象到老板夸我的画面了，诶嘿~！'
                    ]
                },
            ]
        },
        {
            id: '原因分析',
            talks: [
                '小甲：实验师我跟你说，今天我的任务，是要把挂在我后面的大木块给搬走。',
                '小甲：但丢人的是..作为一个搬运机器人，这次的货物我完全搬不动！',
                '小甲：身为机器人的尊严都快失去了，实验师~，可以麻烦你帮我分析一下原因吗？',
            ],
            choices: [{
                name: '可能是**摩擦力**太大了',
                replies: ['小甲：摩擦...力？！（机器人信息检索中...）',
                    '小甲：原来如此！没错就是摩擦力！是摩擦力太大的原因！！',
                    '小甲：根据我的脑内芯片预存的科学知识显示。',
                    '小甲：摩擦力，就是一个物体在另一个物体表面上**运动**或者**将要运动**时，产生的**阻碍它们相对运动**的力。',
                    '小甲：比如我这次向前拉货物，就是因为货物和地面产生了阻碍货物向前摩擦力，所以我才拉的这么费劲。',
                    '小甲：如果摩擦力会阻碍我的话，那是不是只要减少摩擦力，我就可以轻松地拉动货物啦！！',
                    '小甲：可是..该怎么减小摩擦力呢？（机器人信息再次检索中....）',
                    '小甲：完 全 没 有 头 绪！ﾍ(;´Д｀ﾍ)',
                    '小甲：实验师..可能要麻烦你帮忙了！有什么办法可以减少摩擦力的大小呢？',
                ]
            }]
        },
        {
            id: '摩擦力是什么',
            talks: [
                '系统：请提出你的方法。'
            ],
            choices: [{
                    name: '地面的**粗糙程度**也许会影响摩擦力，换个地方试试。',
                    replies: [
                        '也就是地面的**粗糙程度**吗？听起来有道理！',
                        '小甲：但是..实验师，不是我说呀..',
                        '小甲：我连货物都搬不动，你要怎么换个地方呢？',
                    ]
                },
                {
                    name: '货物与地面的**接触面积**也许会影响摩擦力，试着翻转下货物。',
                    replies: ['也就是改变地面的**接触面积**吗？听起来有道理！'],
                },
                {
                    name: '货物给地面的**压力**也许会影响摩擦力，试着改变货物的重量。',
                    replies: ['也就是改变货物的**质量**吗？听起来有道理！'],
                }
            ]
        },
        {
            id: '改变接触面粗糙程度',
            talks: [
                '系统：请选择一种接触面（地面）进行改变...'
            ],
            choices: [{
                    name: '**很粗糙**的草地',
                    replies: ['!']
                },
                {
                    name: '**较为光滑**的木地板',
                    replies: ['!']
                },
                {
                    name: '**非常光滑**的冰面',
                    replies: ['!']
                }
            ]
        },
        {
            id: '改变与接触面的面积',
            talks: [
                '小甲：之前还真没有想到过..把货物翻个面，改变与地面的接触面积什么的..',
                '小甲：实验师，你总能想到一些意想不到的东西呢~！',
                '小甲：可是...接触面积更大一点会比较好呢，还是更小一点会比较好呢？'
            ],
            choices: [{
                    name: '试着把接触面积减小吧',
                    replies: ['没问题，把货物翻到最小的那一面对吧！']
                },
                {
                    name: '试着把接触面积增大吧',
                    replies: ['没问题，把货物翻到最大的那一面对吧！']
                },
            ]
        },
        {
            id: '改变物体的质量',
            talks: [
                '小甲：货物的重量嘛..原来如此！',
                '小甲：可能是老板这次让搬的东西太重了也说不定..',
                '小甲：但..该怎么改变货物重量呢，我可不敢把老板里面的东西给丢掉呀..'
            ],
            choices: [{
                    name: '总之相信我就对了！',
                    replies: [
                        '小甲：那我肯定是相信你的，实验师。',
                        '小甲：不过千万注意，不要弄坏我的货物哦~！'
                    ]
                },
                {
                    name: '我试试用*质量调节器*来帮你吧~！',
                    replies: [
                        '小甲：重量调节器？?虽然不知道是什么，听名字好像是可以调节物体重量的东西..',
                        '小甲：不过先说好哦，不管用什么方法，千万不要弄坏我的货物哦！'
                    ]
                }
            ]
        },
        //地面
        {
            id: '草地',
            talks: [
                '小甲：实验师你是来自哪里的魔法师吗？！地面居然变成了一片充满生命绿的草地！',
                '小甲：感觉空气都新鲜了好多..',
                '小甲：不过相比刚才的地方，地面变得更粗糙了，我看看这次能不能拉动货物吧。'
            ],
        },
        {
            id: '草地后',
            talks: [
                '小甲：嘿呀~！嘿呀~！（卖力拉货中）',
                '小甲：结果....',
                '小甲：完 全 拉 不 动！！',
                '（系统记录：在**很粗糙**的草地上无法拉动重物）',
                '系统：货物拉动失败...'
            ],
        },
        {
            id: '木板',
            talks: [
                '小甲：嗯？突然感受到了家的味道..',
                '小甲：原来地面变成了木地板啊~！',
                '小甲：相比一开始运货的地方，似乎会光滑很多呢~！这次我试试看运货吧！'
            ],
        },
        {
            id: '木板后',
            talks: [
                '小甲：嘿呀~！嘿呀~！（卖力拉货中）',
                '小甲：虽然感觉稍微拉的有点慢...不过好在货物被拉动了！',
                '（系统记录：在**比较光滑**的木地板上可以拉动货物，但移动的比较慢）',
                '系统：货物拉动成功！',
            ],
        },
        {
            id: '冰面',
            talks: [
                '小甲：怎么突然感觉...脚下好凉！',
                '小甲：原来地面被实验师用奇怪的魔法，变成了滑溜溜的冰面！',
                '小甲：还好我站得稳，不然稍不留神就要摔跤了..',
                '小甲：不过在冰面上拉货，还蛮新鲜的，不知道这次还能拉动嘛，总之我先去试试吧~！',
            ],
        },
        {
            id: '冰面后',
            talks: [
                '小甲：嘿~！',
                '小甲：我的老天!这也太快了吧实验师！',
                '小甲：虽然从事这么久的搬运工作，但还是第一次感受到这么快的搬运速度~！',
                '小甲：芜湖~！起飞！',
                '（系统记录：在**光滑**的冰面上可以很轻松的拉动货物）',
            ],
        },
        {
            id: '接触面总结',
            talks: [
                '小甲：啊咧？地面变回来了，感觉还没玩..啊不对，还没搬够呢。',
                '小甲：不过我理解的~！变换场景这么厉害的魔法一定很费体力吧！',
                '小甲：但是在换别的方式之前，我想请实验师帮我一个小忙..',
                '小甲：刚才多亏了实验师，我才知道原来物体之间接触面的粗糙程度，是会影响到摩擦力的大小的。',
                '小甲：可是现在...我记忆芯片上面的内存空间似乎不太够了..',
                '小甲：实验师可以麻烦你帮我总结一下..接触面的粗糙程度和摩擦力大小的关系吗？',
                '系统：根据刚才观察到的不同的接触面与机器人的拉货情况，做出总结吧。'
            ],
            choices: [{
                    name: '接触面越光滑，摩擦力越小',
                    replies: ["小甲：原来是这样！**接触面越光滑，摩擦力越小**。"],
                },
                {
                    name: '接触面越光滑，摩擦力越大',
                    replies: ["小甲：咦？总感觉有些不对呢.."],
                }
            ]
        },
        {
            id: '接触面正确结束',
            talks: [
                '小甲：所以在越光滑的地面上，我拉的越轻松呢~！',
                '小甲：谢谢你~！实验师♪(･ω･)ﾉ',
                '小甲：接下来我们来试试别的方法吧！',
                '系统：请选择别的方式来减小摩擦力，帮助机器人搬运货物吧！',
            ],
        },
        {
            id: '接触面回答错误',
            talks: [
                '小甲：虽然我的记忆存储空间不太够了，但还稍微残留了一点在**光滑**的冰面上快乐地拉货的印象来着..',
            ],
            choices: [{
                name: '其实是接触面越光滑，摩擦力越小',
                replies: ["小甲：原来是这样！**接触面越光滑，摩擦力越小**。"],
            }, ]
        },
        //接触面积
        {
            id: '减小接触面积',
            talks: [
                '小甲：哦~！货物竖起来了~！',
                '小甲：现在接触面明显变小了,会不会更容易拉呢？我先试试！',
            ],
        },
        {
            id: '减小接触面积后1',
            talks: [
                '小甲：接触面积变小似乎好像也没什么变化呀...',
                '(系统记录)',
            ],
            choices: [{
                name: '试着把接触面积变大吧！',
                replies: ['小甲：没问题，把货物翻到最大的那一面对吧！']
            }, ]
        },
        {
            id: '减小接触面积后2',
            talks: [
                '小甲：接触面积变小似乎好像也没什么变化呀...',
                '(系统记录)',
            ],
            choices: [{
                name: '试试别的方法吧！',
                replies: ['小甲：确实...感觉不管怎么翻来覆去，完全都拉不动呢... ']
            }, ]
        },
        {
            id: '增大接触面积',
            talks: [
                '小甲：哦~！货物翻转过来了！',
                '小甲：现在接触面明显变大了，摩擦力应该会变小吧~！这次我再试试看~！',
            ],
        },
        {
            id: '增大接触面积后1',
            talks: [
                '小甲：实验师...怎么感觉接触面积变大也没有啥作用呀...',
            ],
            choices: [{
                name: '试着把接触面积变小吧！',
                replies: ['小甲：没问题，把货物翻到最小的那一面对吧！']
            }, ]
        },
        {
            id: '增大接触面积后2',
            talks: [
                '小甲：实验师...怎么感觉接触面积变大也没有啥作用呀...',
            ],
            choices: [{
                name: '试试别的方法吧！',
                replies: ['小甲：确实...感觉不管怎么翻来覆去，完全都拉不动呢...']
            }, ]
        },
        {
            id: '接触面积总结',
            talks: [
                '系统：根据刚才观察到的不同的接触面的面积与机器人的拉货情况，做出总结吧。',
            ],
            choices: [{
                    name: '摩擦力与物体接触面的面积无关',
                    replies: ['小甲：你说的有道理，经过这几次测试我也发现了，**摩擦力与物体接触面的面积大小是无关的**！']
                },
                {
                    name: '摩擦力与物体接触面的面积有关',
                    replies: [
                        '小甲：实验师，我觉得**摩擦力可能与物体接触面积之间是没有关系的**',
                        '小甲：不然我怎么还是拉不动呢？'
                    ]
                }
            ]
        },
        //质量
        {
            id: '重量调节器',
            talks: [
                '系统：*重量调节器*已准备就绪，帮助机器人调节货物的重量吧！',
                '系统：拖动滑块来调节重物的质量，在选择好质量后，点击确定即可让重物质量改变。'
            ],
        },
        {
            id: '轻松拉货',
            talks: [
                '系统：重物质量改变成功。',
                '小甲：实验师..刚才就看你手忙脚乱的，你在一个人鼓捣些啥呢?!',
                '小甲：看这个眼神..难道说你已经把重物的重量给减轻了，现在试着让我拉拉看对吗？',
                '小甲：好~！我相信你，我来试试看！',
            ],
        },
        {
            id: '轻松拉货后',
            talks: [
                '小甲：嘿~！实验师快看~！',
                '小甲：怎么样？厉害吧~！货物很轻松地就被我拉过去了~.(*^▽^*)',
            ],
            choices: [{
                    name: '我继续帮你调整下重量吧！',
                    replies: [
                        '小甲：实验师原来你还能继续调重量呀~！',
                        '小甲：那么重新交给你啦~！'
                    ]
                },
                {
                    name: '试试其他方法去拉动重物吧！',
                    replies: ['小甲：诶？实验师你的魔力不够了嘛..我还刚沉浸在搬运的快感中没多久耶~!']
                }
            ]
        },
        {
            id: '质量总结',
            talks: [
                '小甲：不过我发现了，如果改变货物的重量，摩擦力确实也会跟着变耶！',
                '小甲：不过总感觉里面的关系有点小小的复杂,作为一个只会搬运的机器人实在是推不出来里面的关系。',
                '小甲：实验师可以麻烦你帮我做做总结吗~？',
                '系统：请根据所调节的重物质量，与机器人的搬运情况，做出总结吧！'
            ],
            choices: [{
                    name: '物体越轻，对地面的压力越小，摩擦力越小',
                    replies: [
                        '小甲：没错，我也发现了这一点！',
                        '小甲：物体越**轻**，对**接触面也就是地面的压力就会越小**，摩擦力就越小，然后我才能拉得动货的~！',
                        '小甲：所以当实验师把货物的重量减小后，我拉起货来那就是突出一个字——“快”！'
                    ]
                },
                {
                    name: '物体越轻，对地面的压力越小，摩擦力越大',
                    replies: [
                        '小甲：我猜实验师你一定在考验我吧~！',
                        '小甲：应该是物体越**轻**，对接触面也就是地面的压力**越小**，摩擦力越**小**才对吧~！',
                        '小甲：虽然身为专为搬运而生的机器人，我也是有一定的思考能力的ヽ(●-`Д´-)ノ！'
                    ]
                }
            ]
        },
        {
            id: '质量结束',
            talks: [
                '小甲：不过既然不能再继续改变重量了，那我们来试试别的方法吧~！',
                '系统：请选择别的方式来减小摩擦力，帮助机器人搬运货物吧！',
            ],
        },
        {
            id: '机器人的吐槽',
            talks: [
                '小甲：**诶？！！！**',
                '小甲：实验师，所有减少摩擦力的方法都已经试过了吗？！',
                '小甲：感觉离目的地...还有...大概...',
                '小甲：咦？！突然发现，原来不知不觉中就到了目的地了呀。'
            ],
            choices: [{
                    name: '太好了！原来这里就是目的地啊~！',
                    replies: [
                        '小甲：没错！出发前，老板还叮嘱过我的，目的地就在这！',
                    ]
                },
                {
                    name: '厉害吧~其实我都计算好了的！',
                    replies: [
                        '小甲：连目的地的位置也在实验师的掌控之中吗？！Σ(⊙▽⊙',
                        '小甲：实验师..你不会是'
                    ]
                }
            ]
        },
    ]
}