export default {
  name: '酸碱中和反应',
  id: 1,
  comment: '',
  paragraphs: [
    {
      id: '初始画面',
      talks: [
        '嘿~！这不是新来的实验家吗？你好呀！'
        // '很高兴你能接受这次【酸碱中和反应实验】的挑战任务。',
        // '嗯？你问我是谁？不好意思忘记自我介绍了Σ(0△0||) ！',
        // '我呢~是这次实验的导航精灵，也可以把我当作是你的小助手哦，在这次任务中我会尽全力帮助你完成这次实验的。 ',
        // '这次的任务需要我们掌握正确的实验仪器操作方法，并学会利用不同的酸碱指示剂，观察与探究酸溶液与碱溶液之间发生的化学现象与反应。',
        // '那么聪明勇敢的实验家，准备好开始这次的实验旅程了吗？'
      ],
      responses: [
        { name: '我准备好了！', feedbacks: ['很好！很有精神！'] },
        {
          name: '看起来好难...',
          feedbacks: ['嘿~放轻松，我可是很相信实验家的实力的，我也会帮助你一起完成这次任务的。']
        }
      ]
    },
    {
      id: '选择酸溶液',
      talks: [
        '事不宜迟，我们先试着开始实验的第一步吧。'
        // '嘛~..因为这次的实验是【酸碱中和反应实验】，那么酸溶液自然是必不可少的。',
        // '这次我特意为你准备了两种酸性溶液供你选择哦，你想使用哪一种酸性溶液呢？'
      ],
      responses: [
        {
          name: '稀盐酸',
          feedbacks: [
            // '看起来你选择了**稀盐酸**呢~，那么接下来交给我来召唤它吧！',
            '**稀盐酸！**就决定是你了！'
          ]
        },
        {
          name: '醋酸溶液',
          feedbacks: [
            // '看起来你选择了**醋酸溶液**呢~，那么接下来交给我来召唤它吧！',
            ' 轮到你了！醋酸溶液！出来吧！ '
          ]
        }
      ]
    },
    {
      id: '酸溶液-盐酸',
      talks: [
        '稀盐酸是一种无色澄清的酸性溶液，它具有**强酸性**，是日常生活中常用的洁厕灵与除锈剂的主要成分，也是我们身体中胃酸的主要成分。'
      ]
    },
    {
      id: '酸溶液-醋酸',
      talks: [
        '醋酸是我们日常中食醋的主要成分，它具有**弱酸性**，是应用最早、使用最多的酸味剂，主要用于调味料、罐头、干酪、果冻等制作。'
      ]
    },
    {
      id: '夸奖',
      talks: ['呼~好啦，需要的酸溶液已经被召唤出来了，顺便一些要用到的实验器材也帮你准备好啦。'],
      responses: [
        {
          name: '干的漂亮！',
          feedbacks: ["谢谢夸奖~！虽然这是我应该做的事情啦，不过不介意的话也可以多夸夸我哦o(〃'▽'〃)o。"]
        },
        { name: '谢谢你！', feedbacks: ['不客气哦~，能帮助到实验师是我应该做的事情啦。'] }
      ]
    },
    {
      id: '滴加酸溶液1',
      talks: [
        '现在酸溶液已经选择好啦，这一次我先帮你把酸溶液滴入试管中吧~。',
        '接下来请一定要注意观察下面的实验操作哦。'
      ]
    },
    {
      id: '滴加酸溶液2',
      talks: [
        '好啦，现在酸溶液已经滴入完成了，不知道实验师看清了刚才的实验操作了吗？'
        // '接下来我要开始提问了。',
        // '聪明的实验师，你觉得刚才滴入溶液的操作是规范的吗？'
      ],
      responses: [
        { name: '我觉得非常规范', feedbacks: ['很遗憾，没有回答正确哦。'] },
        { name: '我感觉有一处不对劲..', feedbacks: ['bingo~！回答正确！'] },
        { name: '我想再看一遍', feedbacks: ['好的，那我们再看一遍吧！'] }
      ]
    },
    {
      id: '滴管滴加解释',
      talks: [
        '在刚才滴入酸溶液的时候，我们将胶头滴管伸入了**试管的内部**，这一步的实验操作其实是**不规范**的。'
        // '要注意，在滴液时如果将胶头滴管伸入试管的内部，很容易使胶头滴管**碰到试管的内壁，导致胶头滴管被污染**。',
        // '并且在下次使用被污染的胶头滴管时，还会影响到其他的药品，造成交叉污染，这样不仅会导致实验结果受到干扰，严重的还会引发化学事故哦。',
        // '所以在使用胶头滴管滴液时，一定要注意将其**竖直悬空于试管之上，不能伸入或接触试管**哦。'
      ],
      responses: [
        {
          name: '原来是这样！',
          feedbacks: [
            // '看来实验师已经弄明白了刚才关于胶头滴管的说明了呀。',
            // '不过，还是稍微有点不放心呢...',
            '对啦！正好我这里有一道小测试题，实验师..不如你试着去完成一下，让我见识下你的实力吧！'
          ]
        },
        {
          name: '还..没有听明白，能重复一遍吗?',
          feedbacks: ['当然没有问题，因为是很重要的知识，接下来我会重新再讲一遍，实验师请注意听讲哟~。']
        }
      ]
    },
    {
      id: '选择碱溶液',
      talks: [
        '既然酸溶液已经滴入完毕，接下来就该轮到**碱溶液**的选择了。'
        // '同样的，这次也有两种碱溶液可以选择哦，分别是氢氧化钠溶液和小苏打溶液。',
        // '实验师，你想使用哪一种碱溶液与刚才的`酸溶液`发生反应呢？'
      ],
      responses: [
        {
          name: '氢氧化钠溶液',
          feedbacks: ['**氢氧化钠溶液**对吗？接下来就看我召唤术吧！', '出来吧！**氢氧化钠！**']
        },
        {
          name: '小苏打溶液',
          feedbacks: ['**小苏打溶液**对吗？接下来就看我召唤术吧！', '出来吧！**小苏打！** ']
        }
      ]
    },
    {
      id: '碱溶液-氢氧化钠',
      talks: [
        '氢氧化钠是工业中常用的碱性药品，它呈**强碱性**，主要用于造纸、纤维素浆粕的生产和肥皂、合成洗涤剂。'
      ]
    },
    {
      id: '碱溶液-小苏打',
      talks: [
        '小苏打又称食用碱，它呈**弱碱性**，在日常生活中用于生产饼干、面包等，是汽水饮料中二氧化碳的发生剂。'
      ]
    },
    {
      id: '滴加碱溶液',
      talks: [
        '好了实验师，现在试着利用胶头滴管，将刚才新增的碱溶液逐滴地滴入试管里面吧。'
        // '在滴入碱溶液的过程中，可以观察与思考酸溶液和碱溶液发生了什么样的变化哦。'
      ]
    },
    {
      id: '承上启下部分',
      talks: [
        '其实在进行酸碱中和反应的过程中，根据酸碱溶液的不同，会造成不同的实验反应现象，比如说生成沉淀物。'
        // '当然啦~！在某些酸碱物质的中和反应中，也不会出现太明显的现象变化，这时候，我们判断中和反应是否发生就需要借助【酸碱指示剂】来帮忙确定啦。'
      ]
    },
    {
      id: '阶段二开场1',
      talks: [
        // '不过现在来看，我们的溶液已经进行过中和反应了，直接添加酸碱指示剂也不太合适呢。',
        // '没办法...只好用这一招了！',
        '时间倒流！ '
      ]
    },
    {
      id: '阶段二开场2',
      talks: [
        '好啦，虽然废了不少功夫,现在我们已经回到之前刚滴入酸溶液的时候了，现在的试管里面只有刚刚选好的酸溶液哦。'
      ],
      responses: [
        {
          name: '天啊，你是怎么做到的..',
          feedbacks: ['嘿嘿~厉害吧( ﾟ∀ﾟ)，不过这不是重点啦，接下来我们就要选择酸碱指示剂了。']
        },
        {
          name: '你也太强了吧！',
          feedbacks: ['嘿嘿~夸的我都不好意思了( ﾟ∀ﾟ)  ，不过这不是重点啦，接下来我们就要选择酸碱指示剂了。']
        }
      ]
    },
    {
      id: '选择酸碱指示剂',
      talks: [
        '实验师，看到桌面上的酸碱指示剂了吗？'
        // '紫色的那瓶是【石蕊试剂】，它在酸性溶液中呈**红色**，中性溶液中呈**紫色**，碱性溶液中呈**蓝色**。',
        // '无色透明的那瓶是【酚酞试剂】，它的特点超级好记~，在碱性溶液下呈**红色**！',
        // '接下来其中一个酸碱指示剂来进行下面的实验吧。'
      ]
    },
    {
      id: '滴入酸碱指示剂',
      talks: [
        '完美~！我看到你已经选择好“趁手”的`酸碱指示剂`咯。'
        // '事不宜迟，咱们就准备开始滴入吧~！',
        // '不过在滴入指示剂的过程中，千千万万要注意观察试管溶液颜色的变化哦。'
      ]
    },
    {
      id: '阶段二-选择碱溶液',
      talks: [
        '`酸碱指示剂`已经顺利投入了，接下来我们试着加入碱性溶液，看看会发生什么样的变化吧~！',
        '接下来就是到了做选择的时间了...'
      ],
      responses: [
        { name: '氢氧化钠溶液', feedbacks: ['嘿~看我的！'] },
        { name: '小苏打溶液', feedbacks: ['嘿~看我的！'] }
      ]
    },
    {
      id: '阶段二-碱溶液-氢氧化钠',
      talks: [
        '氢氧化钠溶液已经召唤出来咯。',
        '氢氧化钠是工业中常用的碱性药品，它呈**强碱性**，主要用于造纸、纤维素浆粕的生产和肥皂、合成洗涤剂。'
      ]
    },
    {
      id: '阶段二-碱溶液-小苏打',
      talks: [
        '小苏打溶液已经召唤出来咯。',
        '小苏打又称食用碱，它呈**弱碱性**，在日常生活中用于生产饼干、面包等，是汽水饮料中二氧化碳的发生剂。'
      ]
    },
    {
      id: '阶段二-滴加碱溶液',
      talks: [
        '现在试着逐滴地试着向试管中滴入`碱溶液`吧。'
        // '千万注意在滴加的时候也别忘了要观察溶液的变化呢。'
      ]
    },
  ]
}
